app/views/loans/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <td style="padding: 3px"><%= loan.item.name %></td>
        <td style="padding: 3px"><%= loan.user.first_name + " " + loan.user.last_name %></td>