app/views/loans/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <strong>User:</strong>
  <%= @loan.user.first_name + " " + @loan.user.last_name %>