app/views/items/_form.html.erb

SELECT "publishers".* FROM "publishers"
SELECT "authors".* FROM "authors"
SELECT "categories".* FROM "categories"
---

    <%= f.collection_select :publisher_id, Publisher.all, :id, :name%>
    <%= f.collection_select :author_ids, Author.all, :id, :name%>
    <%= f.collection_select :category_ids, Category.all, :id, :name%>