app/views/items/index.html.erb

SELECT "authors".* FROM "authors" INNER JOIN "item_authors" ON "authors"."id" = "item_authors"."author_id" WHERE "item_authors"."item_id" = ?  [["item_id", 33]]
---
        <td style="padding: 3px"><%= item.name %></td>
        <td style="padding: 3px"><% item.authors.uniq.reverse.drop(1).reverse.each do |au|%>

SELECT "categories".* FROM "categories" INNER JOIN "item_categories" ON "categories"."id" = "item_categories"."category_id" WHERE "item_categories"."item_id" = ?  [["item_id", 33]]
---
          <%= item.authors.last.name if item.authors.last != nil%></td>
        <td style="padding: 3px"><% item.categories.uniq.reverse.drop(1).reverse.each do |cat|%>