app/views/items/search_advanced.html.erb

  					<option selected><p style="color:#808080"></p></option>
  				<% Category.all.each do |dd| %>
---
SELECT "categories".* FROM "categories" WHERE (Categories.name LIKE %%)