app/views/items/show.html.erb

SELECT "authors".* FROM "authors" INNER JOIN "item_authors" ON "authors"."id" = "item_authors"."author_id" WHERE "item_authors"."item_id" = ?  [["item_id", 19]]
---
  <strong>Autor(zy):</strong>
   <% @item.authors.uniq.reverse.drop(1).reverse.each do |au|%>

SELECT "categories".* FROM "categories" INNER JOIN "item_categories" ON "categories"."id" = "item_categories"."category_id" WHERE "item_categories"."item_id" = ?  [["item_id", 21]]
---
  <strong>Kategoria:</strong>
  <% @item.categories.uniq.reverse.drop(1).reverse.each do |cat|%>