app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "date_born", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Heheh"], ["date_born", "2012-06-06"], ["created_at", "2017-06-06 15:28:01.786562"], ["updated_at", "2017-06-06 15:28:01.786562"]]