app/controllers/item_authors_controller.rb

  def index
    @item_authors = ItemAuthor.all
---
SELECT "item_authors".* FROM "item_authors"

    def set_item_author
      @item_author = ItemAuthor.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]