app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY created_at DESC
---
  def index
    @items = Item.all.order("created_at DESC")

SELECT "items".* FROM "items" WHERE (name LIKE '%%')
---
  def search
    @search_results = Item.search(params[:search],params[:select_order])

SELECT "authors".* FROM "authors"
INSERT INTO "items" ("name", "description", "isbn", "language", "state", "date_pub", "item_img_file_name", "item_img_content_type", "item_img_file_size", "item_img_updated_at", "created_at", "updated_at", "publisher_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    puts item_params.inspect



    item_params["authors"].each do |a|
      puts "-----------------------------------------------------------!!!!"
      puts a
      @item.authors = a


    end
    respond_to do |format|
      if @item.save