app/controllers/loans_controller.rb

  def return
    item = Item.find(params[:item_id])
    value = item.count + 1
    item.update_attribute(:count, value)
    loan = Loan.find(params[:loan_id])
    loan.update_attribute(:date_out, Time.now.strftime("%d/%m/%Y %H:%M"))
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."id" = ?  [["id", 1]]
UPDATE "items" SET "count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["count", 2], ["updated_at", "2017-06-07 12:09:16.092938"], ["id", 24]]
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "loans" SET "date_out" = ? WHERE "loans"."id" = ?  [["date_out", "2017-06-07"], ["id", 1]]

  def undo_return
    item = Item.find(params[:item_id])
    value = item.count - 1
    item.update_attribute(:count, value)
    loan = Loan.find(params[:loan_id])
    loan.update_attribute(:date_out, "0001-01-01")
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "items" SET "count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["count", 3], ["updated_at", "2017-06-07 12:19:56.406012"], ["id", 24]]
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "loans" SET "date_out" = ? WHERE "loans"."id" = ?  [["date_out", "0001-01-01"], ["id", 3]]

  def index
    @loans = Loan.all
    @loans_waiting = Loan.where(:date_out => "0001-01-01")
---
SELECT "loans".* FROM "loans"
SELECT "loans".* FROM "loans" WHERE ("loans"."date_out" != ?)  [["date_out", "0001-01-01"]]

  def create
    @loan = Loan.new(loan_params)
    item = Item.find(loan_params[:item_id])
    value = item.count - 1
    item.update_attribute(:count, value)

    respond_to do |format|
      if @loan.save
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT "items".* FROM "items"
UPDATE "items" SET "count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["count", 0], ["updated_at", "2017-06-07 12:23:34.707597"], ["id", 26]]
INSERT INTO "loans" ("item_id", "user_id", "date_in", "date_out", "librarian_id") VALUES (?, ?, ?, ?, ?)  [["item_id", 24], ["user_id", 2], ["date_in", "2017-06-06"], ["date_out", "2017-06-06"], ["librarian_id", 2]]

  def update
    respond_to do |format|
      if @loan.update(loan_params)
---
UPDATE "loans" SET "date_in" = ?, "date_out" = ? WHERE "loans"."id" = ?  [["date_in", "2017-06-07"], ["date_out", "0001-01-01"], ["id", 3]]

  def set_loan
    @loan = Loan.find(params[:id])
---
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]