app/controllers/penalties_controller.rb

  def index
    @penalties = Penalty.all
---
SELECT "penalties".* FROM "penalties"