app/controllers/users_controller.rb

SELECT "loans".* FROM "loans" WHERE "loans"."id" = ?  [["id", 3]]
---
  def profile
    @data = Loan.where(id: current_user.id)