app/controllers/users_controller.rb

SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = ? AND ("loans"."date_out" != ?)  [["user_id", 2], ["date_out", "0001-01-01"]]
SELECT "loans".* FROM "loans" WHERE "loans"."id" = ? AND "loans"."date_out" = ?  [["id", 2], ["date_out", "0001-01-01"]]
---
  def profile
    @data = Loan.where(:user_id => current_user.id).where.not(:date_out => "0001-01-01")
    @actual_data = Loan.where(:date_out => "0001-01-01", :user_id => current_user.id)